<a href="https://colab.research.google.com/github/Denis-Yen/DataScience/blob/main/1_DataCleaning.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

El **data wrangling**, a veces denominada **data munging**, es el proceso de transformar y mapear datos de un dataset *raw* (en bruto) en otro formato con la intención de hacerlo más apropiado y valioso para una variedad de propósitos posteriores, como el análisis. Un **data wrangler** es una persona que realiza estas operaciones de transformación.

Esto puede incluir munging, visualización de datos, agregación de datos, entrenamiento de un modelo estadístico, así como muchos otros usos potenciales.

In [ ]:
import pandas as pd # Pandas es la libreria o el modulo de Python de input/output a la data

In [ ]:
data = pd.read_csv("/content/drive/MyDrive/Colab Notebooks/Churn-arboles.csv")
data.head(5)

In [ ]:
# La dimension del dataset
data.shape # Observaciones, variables

(1345, 8)

In [ ]:
# Observamos los primeros valores de los datos
#data.head(1)
data.tail()

        ID  EDAD       SEXO    CIVIL  HIJOS  INGRESO AUTO    CHURN
1340  4987    38   Femenino   Casado      2  84653.1   Si  No Fuga
1341  4993    95   Femenino  Soltero      2  52997.5   Si     Fuga
1342  4996    70   Femenino   Casado      1  85192.9   Si     Fuga
1343  4998    37  Masculino   Casado      0  11693.3   No  No Fuga
1344  4999    41  Masculino   Casado      0  59898.4   No  No Fuga

### Crear un subconjunto de datos

#### Subconjunto de columna o columnas

In [ ]:
data1 = data[["SEXO", "EDAD", "CIVIL"]]

In [ ]:
data1.head(3)

        SEXO  EDAD    CIVIL
0   Femenino    57   Casado
1   Femenino    68   Casado
2  Masculino    34  Soltero

In [ ]:
type(data1)

pandas.core.frame.DataFrame

In [ ]:
subset = data[["EDAD", "CIVIL", "INGRESO"]]

In [ ]:
subset.head()

   EDAD    CIVIL  INGRESO
0    57   Casado  27535.3
1    68   Casado  81000.9
2    34  Soltero  87467.1
3    60   Casado  83220.6
4    28   Casado  20850.4

In [ ]:
data.head(1)

   ID  EDAD      SEXO   CIVIL  HIJOS  INGRESO AUTO CHURN
0   0    57  Femenino  Casado      2  27535.3   Si  Fuga

In [ ]:
# Ejercicio N°01
# Crear un dataframe con las columnas SEXO, INGRESO Y la variable Target
subset2= data[["SEXO", "INGRESO", "CHURN"]]

In [ ]:
subset2.head(3)

        SEXO  INGRESO    CHURN
0   Femenino  27535.3     Fuga
1   Femenino  81000.9     Fuga
2  Masculino  87467.1  No Fuga

In [ ]:
type(subset)

pandas.core.frame.DataFrame

In [ ]:
# Siempre es muy usado generar una lista de nombres de columnas y después generar el subset de datos
columnas_input = ["EDAD","AUTO"]
# Del dataset elegimos las columnas anteriormente seleccionadas
subset = data[columnas_input]
# Mostramos lo deseado
subset.head()

   EDAD AUTO
0    57   Si
1    68   No
2    34   Si
3    60   No
4    28   No

In [ ]:
data.head(1)

   ID  EDAD      SEXO   CIVIL  HIJOS  INGRESO AUTO CHURN
0   0    57  Femenino  Casado      2  27535.3   Si  Fuga

In [ ]:
# Ejercicio N°02
# Generar una lista de variables con las variables Estado Civil, Ingreso y auto.
columnas_input = ["CIVIL", "INGRESO", "AUTO"]
subset3 = data[columnas_input]
subset3.head(2)

    CIVIL  INGRESO AUTO
0  Casado  27535.3   Si
1  Casado  81000.9   No

In [ ]:
# Podemos generar otra lista de columnas que no deseemos y por complemento retirarlas del set de datos
columnas_no_input = ["ID", "EDAD"]
columnas_no_input

In [ ]:
# Genero la lista total de variables
columnas_totales = data.columns.values.tolist()
columnas_totales

In [ ]:
# Me quedo con las columnas necesarias
columnas_complemento = [x for x in columnas_totales if x not in columnas_no_input]
columnas_complemento

['SEXO', 'CIVIL', 'HIJOS', 'INGRESO', 'AUTO', 'CHURN']

In [ ]:
subset2 = data[columnas_complemento]
subset2.head()

        SEXO    CIVIL  HIJOS  INGRESO AUTO    CHURN
0   Femenino   Casado      2  27535.3   Si     Fuga
1   Femenino   Casado      2  81000.9   No     Fuga
2  Masculino  Soltero      0  87467.1   Si  No Fuga
3  Masculino   Casado      2  83220.6   No     Fuga
4   Femenino   Casado      2  20850.4   No     Fuga

In [ ]:
# Ejercicio N°03
# Generar una lista con columnas no deseadas como CIVIL, AUTO, HIJOS y CHURN, y de las columnas totales suprimirlas

#### Subconjunto de filas

In [ ]:
data[:5] # Me salen las 5 primeras filas con todas las columnas

   ID  EDAD       SEXO    CIVIL  HIJOS  INGRESO AUTO    CHURN
0   0    57   Femenino   Casado      2  27535.3   Si     Fuga
1   4    68   Femenino   Casado      2  81000.9   No     Fuga
2   8    34  Masculino  Soltero      0  87467.1   Si  No Fuga
3  10    60  Masculino   Casado      2  83220.6   No     Fuga
4  13    28   Femenino   Casado      2  20850.4   No     Fuga

In [ ]:
data[0:10]

   ID  EDAD       SEXO    CIVIL  HIJOS   INGRESO AUTO    CHURN
0   0    57   Femenino   Casado      2  27535.30   Si     Fuga
1   4    68   Femenino   Casado      2  81000.90   No     Fuga
2   8    34  Masculino  Soltero      0  87467.10   Si  No Fuga
3  10    60  Masculino   Casado      2  83220.60   No     Fuga
4  13    28   Femenino   Casado      2  20850.40   No     Fuga
5  17    52  Masculino  Soltero      0  84112.60   No  No Fuga
6  19    87   Femenino  Soltero      2   3776.12   No     Fuga
7  20    88   Femenino   Casado      2  73865.90   Si     Fuga
8  22    76  Masculino   Casado      2  30933.60   Si  No Fuga
9  23    76   Femenino   Casado      1  12309.60   No     Fuga

In [ ]:
data[:15] # CORRECCIÓN: es lo mismo que data[0:8]

In [ ]:
data[0:4]

   ID  EDAD       SEXO    CIVIL  HIJOS  INGRESO AUTO    CHURN
0   0    57   Femenino   Casado      2  27535.3   Si     Fuga
1   4    68   Femenino   Casado      2  81000.9   No     Fuga
2   8    34  Masculino  Soltero      0  87467.1   Si  No Fuga
3  10    60  Masculino   Casado      2  83220.6   No     Fuga

#### Subconjuntos de filas con condiciones booleanas

In [ ]:
## Clientes con INGRESO > 30000, mayores de 34 años y de sexo femenino
data1 = data[(data["INGRESO"]>30000) & (data["EDAD"]>=34) & (data["SEXO"]=="Femenino")]
data1.head(3)

    ID  EDAD      SEXO   CIVIL  HIJOS  INGRESO AUTO    CHURN
1    4    68  Femenino  Casado      2  81000.9   No     Fuga
7   20    88  Femenino  Casado      2  73865.9   Si     Fuga
11  28    90  Femenino  Casado      0  91620.6   No  No Fuga

In [ ]:
data.CHURN.value_counts() # Cuenta la cantidad de clientes que fugaron y cuales no
data.SEXO.value_counts()

Femenino     673
Masculino    672
Name: SEXO, dtype: int64

In [ ]:
## Clientes Fugados (CHURN = "Fuga")
data2 = data[data["CHURN"]=="Fuga"]
data2.head(4)

In [ ]:
## AND -> &
data3 = data[(data["INGRESO"]>30000) & (data["CHURN"]=="No Fuga")]
data3.shape

(612, 8)

In [ ]:
## OR -> |
data4 = data[(data["SEXO"]=="Femenino") | (data["CHURN"]=="Fuga")]
data4.head(6)

   ID  EDAD       SEXO    CIVIL  HIJOS   INGRESO AUTO CHURN
0   0    57   Femenino   Casado      2  27535.30   Si  Fuga
1   4    68   Femenino   Casado      2  81000.90   No  Fuga
3  10    60  Masculino   Casado      2  83220.60   No  Fuga
4  13    28   Femenino   Casado      2  20850.40   No  Fuga
6  19    87   Femenino  Soltero      2   3776.12   No  Fuga
7  20    88   Femenino   Casado      2  73865.90   Si  Fuga

In [ ]:
# Ejercicio N°04
# Generar un subset de clientes con ingresos mayores a 1000 soles, No Fugados y con edades mayores a 28 años.
data5 = data[(data["INGRESO"]>1000) & (data["CHURN"]=='No Fuga') & (data["EDAD"]>28)]
data5.head(3)

   ID  EDAD       SEXO    CIVIL  HIJOS  INGRESO AUTO    CHURN
2   8    34  Masculino  Soltero      0  87467.1   Si  No Fuga
5  17    52  Masculino  Soltero      0  84112.6   No  No Fuga
8  22    76  Masculino   Casado      2  30933.6   Si  No Fuga

In [ ]:
## EDAD, AUTO y CHURN de los primeros 20 individuos
subset_primeros_50 = data[["EDAD", "AUTO", "CHURN"]][2:50] # Empezando desde el tercero
subset_primeros_50

In [ ]:
subset[:10]

#### Filtrado con ix -> loc e iloc

In [ ]:
data.ix[1:10, 3:6] ## Primeras 10 filas, columnas de la 3 a la 6

In [ ]:
data.iloc[2:10 , 2:6] # data[filas,columnas]

In [ ]:
data.iloc[:,3:6] ##Todas las filas para las columnas entre la 3 y la 6
data.iloc[1:10,:] ##Todas las columnas para las filas de la 1 a la 10

   ID  EDAD       SEXO    CIVIL  HIJOS   INGRESO AUTO    CHURN
1   4    68   Femenino   Casado      2  81000.90   No     Fuga
2   8    34  Masculino  Soltero      0  87467.10   Si  No Fuga
3  10    60  Masculino   Casado      2  83220.60   No     Fuga
4  13    28   Femenino   Casado      2  20850.40   No     Fuga
5  17    52  Masculino  Soltero      0  84112.60   No  No Fuga
6  19    87   Femenino  Soltero      2   3776.12   No     Fuga
7  20    88   Femenino   Casado      2  73865.90   Si     Fuga
8  22    76  Masculino   Casado      2  30933.60   Si  No Fuga
9  23    76   Femenino   Casado      1  12309.60   No     Fuga

In [ ]:
data.head(3)

   ID  EDAD       SEXO    CIVIL  HIJOS  INGRESO AUTO    CHURN
0   0    57   Femenino   Casado      2  27535.3   Si     Fuga
1   4    68   Femenino   Casado      2  81000.9   No     Fuga
2   8    34  Masculino  Soltero      0  87467.1   Si  No Fuga

In [ ]:
# Generamos un subset a nivel de filas y columnas
#data.iloc[1:10,[2,5,7]] # Filas del 1 al 10 y columnas en la posición 2,5 y 7
data.iloc[0:20,[1,5]] # Filas de 0 a la 20, y columnas en la posicion 2 y 5

In [ ]:
# Puedo hacer el subset de acuerdo a lo que necesite
data.iloc[[1,5,8,36], [2,5,7]]

In [ ]:
data.iloc[[1,5,8,36], [2, 3, 4]]

#### Insertar nuevas filas en el dataframe

In [ ]:
data["IngresoPerHijo"] = data["INGRESO"]/(data["HIJOS"]+1) # se suma 1 para que la division no sea divida por 0

In [ ]:
data.head()

In [ ]:
data["Ingreso/Edad"] = data["INGRESO"]/data["EDAD"]
data.head(2)

   ID  EDAD      SEXO   CIVIL  ...  CHURN  Ingreso/Hijo IngresoPerHijo Ingreso/Edad
0   0    57  Femenino  Casado  ...   Fuga   9178.433333    9178.433333   483.075439
1   4    68  Femenino  Casado  ...   Fuga  27000.300000   27000.300000  1191.189706

[2 rows x 11 columns]

In [ ]:
# Ejercicio N°05
# Generar la variable INGRESO/EDAD o Numero de hijos **2
import numpy as np
np.power(data.HIJOS,2) # POtencia del numero de hijos al cuadrado

In [ ]:
data = data.iloc[:, 0:9]

In [ ]:
data.head()

   ID  EDAD       SEXO    CIVIL  HIJOS  INGRESO AUTO    CHURN  Ingreso/Hijo
0   0    57   Femenino   Casado      2  27535.3   Si     Fuga   9178.433333
1   4    68   Femenino   Casado      2  81000.9   No     Fuga  27000.300000
2   8    34  Masculino  Soltero      0  87467.1   Si  No Fuga  87467.100000
3  10    60  Masculino   Casado      2  83220.6   No     Fuga  27740.200000
4  13    28   Femenino   Casado      2  20850.4   No     Fuga   6950.133333

### Generación aleatoria de números

In [ ]:
import numpy as np

In [ ]:
##Generar un número aleatorio entero entre 1 y 100
np.random.randint(1,100)

56

In [ ]:
##La forma más clásica de generar un número aleatorio es entre 0 y 1 (con decimales)
np.random.random()

0.5387592989518204